---
kind: method
id: M:Autodesk.Revit.DB.CurveByPointsUtils.Dispose
source: html/2548a0d5-4011-f2ad-cb16-a37a01385570.htm
---
# Autodesk.Revit.DB.CurveByPointsUtils.Dispose Method

Releases all resources used by the CurveByPointsUtils

## Syntax (C#)
```csharp
public void Dispose()
```